[{"Title":"Have a feedback loop","UUID":"urn:uuid:4dd42fca-669d-4f13-8312-9c70f78b7823","Abstract":["A control loop works better when the controller actually considers input and output.","(Ask yourself) What works well currently, do I want to do that again? What bothers me, do I want to try something different or even avoid that?"],"Negative example":["Alice eats according to a specific diet to achieve a certain physiological goal. However, Alice never actually checks whether she makes progress, and thus never notices that her diet doesn't actually work.","Bob does not notice that his finances/health/other systems have slowly deteriorated over time, and therefore cannot do anything against it."],"Positive example":["At the end of each day/month/year, Carol spends some time on review, and adjusts her goals/priorities/values."],"Consequence":["Learn from your mistakes. Also, learn from other people's mistakes.","This entire list."],"See also":[{"Dare to think about yourself":"https://www.youtube.com/watch?v=fCUTX1jurJ4"},{"Humorous take":"https://xkcd.com/1457/"}]},{"Title":"Focus on reality","UUID":"urn:uuid:72a50b2c-2f6c-45d2-a589-8573cd3d4eb4","Abstract":["Only reality can have an influence on you.","Deal with the current state, not what you wish the state would already be."],"Negative example":["Carlos keeps up on everything wrong with a situation that is geographically/demographically/politically far away, and burns himself out by worrying, without actually achieving anything.","Dave has spent too much time thinking about horror/fantasy/sci-fi stories/movies/games/daydreams/novels, and lost track of what's happening around him.","After preparing for all possibilities and considering each eventuality, Chuck got surprised by the most likely outcome.","Dan abhors the current situation, and therefore simply denies those aspects of reality."],"Positive example":["Charlie acknowledges new information, and now can decide how and whether to act.","David verifies his assumptions before deciding something major, enabling him to succeed more often than chance."],"Consequence":["Enjoy news/fiction/daydreaming, explore hypotheticals, but don't drown in it.","Don't shoot the messenger.","Collect data before you “optimize”. For example, journal your experiences, insights, rationale, etc."],"See also":[{"“This Video Will Make You Angry” (CGP Grey)":"https://www.youtube.com/watch?v=rE3j_RHkqJc"},{"“Repression”":"https://en.wikipedia.org/wiki/Repression_(psychology)"}]},{"Title":"Everything is a function of time","UUID":"urn:uuid:5f04ccf4-a632-4a58-8d3f-a5c6651efca4","Abstract":["Social/financial/moral status change over time."],"Negative example":["Frank has to update something, and calls the new document NewSomething. The next time, he will call it NewNewSomething. Soon, all metadata is lost, impeding him in the future.","Rupert got a conviction for something minor, faces justice and rehabilitation, and clearly has learnt his lesson. However, employers/neighbors/companies consider him dangerous, unable to grasp the concept that people can change."],"Positive example":["Faythe has known Erin for several decades. While deciding on a birthday present, she decides against something that Erin would have liked back in the days, because his interests have moved on, and it would no longer spark joy for him."],"Consequence":["Tag information with date, regardless whether a paper/file/brain stores it.","Regularly reevaluate whether your assumptions, systems, values, and goals still make sense."],"See also":[{"The only constant is change":"https://en.wikiquote.org/wiki/Heraclitus"},{"The “boiling frog” fable":"https://en.wikipedia.org/wiki/Boiling_frog"},{"The “ladder monkeys” fable":"https://wiki.c2.com/?TheFiveMonkeys"}]},{"Title":"Do the right thing, right now","UUID":"urn:uuid:78fa76c2-6b99-4f57-8f20-de6910fa0de5","Abstract":["Which actions do you have available, in this moment?","What should you be doing right now, realistically?"],"Negative example":["Heidi is upset about the situation, and angrily yells that “they” should be doing something, and fails to realize that she, too, could improve things."],"Positive example":["Grace enjoys a movie, without 80% of her brain being busy checking and analyzing what she has planned for the day/week/month."],"Consequence":["Never regret: Either you did it intentionally, or you had no way of knowing any better.","Making no decision at all is often one of the worst decisions you could make. Instead, default to action, especially on the small things in life.",{"Perfect is the opposite of good":"https://ciaranonuallainblog.wordpress.com/2020/10/04/motivation-and-why-finishing-a-personal-project-is-hard/"},{"Figure out how to participate, e.g. in your country":"https://www.youtube.com/watch?v=KXXYkLa-HHI"},"A life spent failing is better than a life not starting; and if you don't do it “right now” at any moment, then you'll end up never starting."],"See also":[{"Victory, not Vengence":"http://www.anachronsounds.de/webfiles/history.htm"},{"“Yak Shaving” (negative example)":"https://en.wiktionary.org/wiki/yak_shaving"},{"“Keep it simple, silly”":"https://en.wikipedia.org/wiki/KISS_principle"},{"“YAGNI”":"https://en.wikipedia.org/wiki/You_aren%27t_gonna_need_it"}]},{"Title":"Be aware of your own biases","UUID":"urn:uuid:e574a978-9a99-49dd-9a2c-7bb2d18f768c","Abstract":[{"Some biases are good. Most aren't":"https://en.wikipedia.org/wiki/List_of_cognitive_biases"}],"Negative example":[{"Peggy always avoids risks – even when the losses are limited, and the chances are good. Peggy thus pays a huge opportunity cost":"https://en.wikipedia.org/wiki/Opportunity_cost"}],"Positive example":[{"Rupert wants to read more. Instead of setting arbitrary goals that cause him to feel bad, he instead intentionally introduces a small bias in his decision making; for example, he announces a “Year of Reading”":"https://www.youtube.com/watch?v=NVGuFdX5guE"}],"Consequence":["Try different things, break the bias of following your own footsteps just because they are your's. This applies to hobbies, food, associations with friend groups, and many more.","Pay attention to the things that go right, to avoid the Negativity Bias. Keep a gratitude log, for example.",{"Risk-aversion can be a good thing, but often the factor (usually two to five) is too large. If the disadvantage of an action is only minor, risk-aversion leads to opportunity cost":"https://www.youtube.com/watch?v=vBX-KulgJ1o"},{"An important part to overcome inaction bias is Assertion of Values":"https://www.youtube.com/watch?v=mhFQA998WiA"}],"See also":[{"“Harry Potter and the Methods of Rationality” examines a lot of biases and how to detect or even avoid them":"https://www.youtube.com/watch?v=gLglQ5-Q9FE&list=PLgJhb0Q9X1Qzw3bG9ZmcCKLIVwMawh6MM&index=1"},{"Rage is a surprisingly infectiuous emotion, thus ignoring it can be a good idea":"https://www.youtube.com/watch?v=rE3j_RHkqJc"}]},{"Title":"Automate everything, eventually","UUID":"urn:uuid:7ad85b13-528a-4a5b-87d3-0b68df411942","Abstract":"Your life expectancy is large enough; you'll probably have to do it again and again.","Negative example":["Every day, Judy wakes up and agonizes over which particular shirt to wear, what specifically to eat for breakfast, etc, instead of making a plan once and having a good idea in advance.","Mallet organized an event for the second time. Because he didn't make any notes last year during the first event, he has to reinvent all solutions and rediscover all problems from scratch."],"Positive example":["Mallory paid close attention when he had to put in a fly net years ago. Moving into a new apartment, he finishes it in under an hour."],"Consequence":["Build habits: Deciding against a good habit is harder than deciding in favor of a good action.",{"Use your decisions wisely; you only have a limited capacity":"https://www.ted.com/talks/barry_schwartz_the_paradox_of_choice?rid=nMh3l7bo1Qwh"},"Teach your autopilot the basic steps in your life. This makes them more reliable and takes less energy.","And, of course, mechanical automation: Dish washers, scripts, calenders, etc.","Focus on the process, if there is any chance that you'll have to do it more than a few times."],"See also":[{"Automation should be a gradual process":"https://xkcd.com/1205/"}]},{"Title":"You are, not “have”","UUID":"urn:uuid:566438be-bcf5-4751-9c40-8b57f4715eea","Abstract":["Turns out, your brain is connected to your body. Listen to it; all that sensory input is there for a reason.","Does a clock “have” hands? Does it “have” a battery, a casing, printed numbers, various electronic parts, etc? If so, what “is” the clock? Likewise, you “are” your body: Take care of your mind, your eyes, your hands, your heart, etc."],"Negative example":["Pat ignores a pain he “has always had” and thus ignores. A single trip to the doctor could have told him what it was, and how to fix the underlying problem."],"Positive example":["Mike notices that sometimes he strongly likes and sometimes strongly dislikes heavily salted French fries. Turns out, his body knows how much salt it currently needs, and can signal a matching “appetite” accordingly."],"Consequence":["Pain is a warning light. “Turning off” the warning light shouldn't be your first action when it lights up.","Don't punish your body (unless you're into that)."]},{"Title":"Nobody knows anything","UUID":"urn:uuid:4a9cef68-4f24-4e1a-ba9a-f86609d08fe0","Abstract":["Every sentence is technically a statement that is prefixed by “I believe that …”.","True and absolute knowledge does not exist."],"Negative example":["The doctor's assistant tells Michael that he shouldn't eat anything for the next three days. That's because the assistant misunderstood the doctor's orders, and Michael should merely reduce lactose intake for the next three days.","Siegfried has often experienced certain people around him to be “wrong”. Siegfried now “knows” that they are wrong, and will not even question his own beliefs."],"Consequence":[{"Beware the false dichotomy":"https://yourlogicalfallacyis.com/black-or-white"},"Correlation is not causation. Also, there are other forms of causation, like confoundation.",{"“What do I believe, and why do I believe it?”":"https://conceptspace.fandom.com/wiki/Fundamental_Question_of_Rationality"},"All rules, guidelines, and advice (including this page) are slightly off. Always check whether they make sense in context.",{"Do not assume malevolence in what can be explained by wrong assumptions (or bad information)":"https://en.wikipedia.org/wiki/Hanlon%27s_razor"}],"See also":[{"… except for mathematics":"https://xkcd.com/263/"}]},{"Title":"Start at the problem, not the solution","UUID":"urn:uuid:ac919de7-3ca0-46f6-843d-3ec917729284","Abstract":["Making a problem go away entirely is easier than dealing with the trouble it causes.","Often enough, there's a much simpler way to do certain things."],"Negative example":[{"Excessive Yak Shaving":"https://www.youtube.com/watch?v=_UZFI-8D5uA"},"Niaj has a file that contains earth's geometry, and needs to convert it to a different format. Niaj wastes several days just writing a highly-optimized program that runs once and will never be used again."],"Positive example":["Olivia and Oscar argue about the room temperature: She is freezing, and he is sweating. Instead of arguing about the world climate or coming up with an elaborate scheme of who should be in power over the thermostat, they simply switch places so that Olivia sits closer to the radiator."],"Consequence":[{"If all you have is a hammer":"https://en.wiktionary.org/wiki/if_all_you_have_is_a_hammer,_everything_looks_like_a_nail"}],"See also":[{"Yak Shaving":"https://en.wiktionary.org/wiki/yak_shaving#Noun"},{"Sometimes, bodging is enough":"https://www.youtube.com/watch?v=lIFE7h3m40U"}]}]